In [4]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

**Prefix dan Suffix pada seluruh Kolom Pandas Data Frame**

- prefix menambahkan string di depan string
- suffix menambahkan string di belakang string

In [13]:
x_rows = 5
x_cols = 5
cols = tuple('ABCDE') #untuk penamaan label kolom

#membuat table dengan isi angka random
df = pd.DataFrame(np.random.randint(1, 10, size =(x_rows, x_cols)), columns = cols)
df

   A  B  C  D  E
0  4  6  9  9  2
1  7  6  2  4  6
2  2  1  4  4  6
3  8  9  8  1  8
4  3  4  8  7  1

**prefix**

In [14]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        6        9        9        2
1        7        6        2        4        6
2        2        1        4        4        6
3        8        9        8        1        8
4        3        4        8        7        1

**suffix**

In [15]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        6        9        9        2
1        7        6        2        4        6
2        2        1        4        4        6
3        8        9        8        1        8
4        3        4        8        7        1

**Pemilihan baris (rows selection) pada Data Frame**

In [18]:
a_rows = 11
a_cols = 6
cols = tuple('ABCDEF')

#membuat table dengan isi angka random
df = pd.DataFrame(np.random.randint(10, 20, size =(a_rows, a_cols)), columns = cols)
df

     A   B   C   D   E   F
0   15  13  11  13  18  11
1   17  15  12  18  12  10
2   17  17  16  13  11  16
3   11  17  14  16  16  18
4   14  19  12  10  12  19
5   13  18  13  14  12  16
6   12  14  17  17  19  17
7   17  11  10  18  10  14
8   13  12  11  18  13  15
9   11  10  15  15  11  19
10  10  16  12  11  12  18

Selection dengan fungsi **isin()**

ini sama dengan penggunaan operator logika or (|)

df[df['A'].isin([12, 17])]

Operator negasi (~) berguna untuk mencari nilai yang tidak sama

In [21]:
df[~df['A'].isin([12, 17])]

     A   B   C   D   E   F
0   15  13  11  13  18  11
3   11  17  14  16  16  18
4   14  19  12  10  12  19
5   13  18  13  14  12  16
8   13  12  11  18  13  15
9   11  10  15  15  11  19
10  10  16  12  11  12  18

**Konversi tipe data String ke Numerik pada kolom Data Frame**